src/Documents/ИнвентаризацияТоваровНаСкладе/ИнвентаризацияТоваровНаСкладе.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="57fa4881-8ea1-451d-92c8-7dd84266404a">
  <name>ИнвентаризацияТоваровНаСкладе</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="62c75192-6444-4eeb-992c-bbbc3f4c1f91">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="0b0c1280-f9e7-4b79-ae80-e7566e2262ac">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="cb4154de-c22f-4707-b49d-2cf20b61df46">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="6706d540-644d-4e64-b78e-3a3d806a9ae3">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="541b6451-9aa0-4d6a-aece-a1bf05a29481">
      <name>КоличествоУчет</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="002946a1-fbe5-476c-9e97-da85566f4525">
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="6bf6677f-d1be-4351-bdee-1ccd92235b6a">
      <name>СчетУчета</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="4836de1f-9d1b-404a-a089-4f581960a7da">
      <name>ЦенаВРознице</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/ИнвентаризацияТоваровНаСкладе/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура Базар_ТоварыЦенаПриИзмененииПосле(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	СтрокаТабличнойЧасти.СуммаУчет = СтрокаТабличнойЧасти.Цена * СтрокаТабличнойЧасти.КоличествоУчет;
	
КонецПроцедуры

&НаКлиенте
Процедура Базар_ЗаполнитьЦеныПоЦенамНоменклатурыВместо(Команда)
	
	ТекстВопроса = НСтр("ru = 'Вы действительно хотите перезаполнить цены, по ценам номенклатуры? При этом изменсятся суммы (факта и учета).'");
	Оповещение = Новый ОписаниеОповещения("ОтветНаВопросПерезаполнитьЦены", ЭтотОбъект, Неопределено);
	ПоказатьВопрос(Оповещение,
	               ТекстВопроса,
	               РежимДиалогаВопрос.ДаНет,
	               30,
	               КодВозвратаДиалога.Да,
	               "Перезаполнить цены?",
	               КодВозвратаДиалога.Нет);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтветНаВопросПерезаполнитьЦены(Ответ, ДополнительныеНастройки) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ЗаполнитьЦеныПоЦенамНоменклатуры();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЦеныПоЦенамНоменклатуры()
	
	Документы.ИнвентаризацияТоваровНаСкладе.ЗаполнитьЦеныПоЦенамНоменклатуры(Объект.Товары, Объект.Дата);
	Модифицированность = Истина;
	
КонецПроцедуры
